<?php
// file:lang-ja.inc.php
global $lang_data;

$lang_data = [
  'New' => '📖 新規',
  'Edit' => '📝 編集',
  'Email Logs' => '💌 送信ログ',
  'Users List' => '🙆‍♂️ 一覧',
  'Login' => '🏠 ログイン',
  'Logout' => '🚪 ログアウト',
  'Search' => '🔍 検索',
  'Private Mode' => '⛔ 非公開モード',
  'Please login.' => 'ログインしてください。',
  'User' => 'ユーザー',
  'Email' => 'Eメール',
  'Password' => 'パスワード',
  'Invalid User or Password.' => 'ユーザーかパスワードが間違っています。',
  'Success' => '処理しました。',
  'Login successful.' => 'ログイン成功。',
  'Really?' => '本当ですか？',
  'Yes' => 'はい',
  'No' => 'いいえ',
  'Signup' => '新規ユーザー登録',
  'Confirm' => '確認',
  'Delete' => '削除',
  'Admin' => '管理者',
  'Admin Menu' => '管理者メニュー',
  'Invalid Username' => 'ユーザー名が不正です。',
  'Invalid Email' => 'メールアドレスが不正です。',
  'Passwords do not match.' => 'パスワードが一致しません。',
  'Post Comment' => 'コメント投稿',
  'Close' => '閉じる',
  'You have been logged out.' => 'ログアウトしました。',
  'Add' => '追加',
  'Save temp' => '一時保存',
  'Load temp' => '一時保存を読込',
  'Save &amp; Show' => '保存して表示',
  'Save to Repo' => '編集履歴に保存',
  'Conflict editing, Please submit and check.' => 
    '編集が衝突しました。'.
    '「保存して表示」ボタンを押して差分を確認してください。',
  'Could not write file.' => 'ファイルに書き込みができません。',
  'Page Not Found.' => 'ページが見当たりません。',
  'History' => '履歴',
  'The username alredy registerd.' => 'ユーザー名が既に使われています。',
  'The email already registerd.' => 'Eメールは既に登録されています。',
  'Please check email.' => 
    'Eメールを送信しました。確認して登録を完了してください。'.
    '迷惑メールフォルダに分類されてしまっている可能性も'.
    'あるので併せてご確認ください。',
  'Please access here: %s' => 
    "この度は新規登録ありがとうございます。\n".
    "下記のURLにアクセスすると完成です。\n".
    "[URL] %s\n",
  'Invalid Token' => 'トークンの間違い',
  'Invalid Token in email' => 'トークンが間違っています。メールアドレスに書かれているURLを過不足なくコピーしてブラウザで開いてください。',
  'Admin Page' => '管理者ページ',
  'You do not have admin perm.' => '管理者権限がないとアクセスできません。',
  'Delete All' => 'すべて削除する',
  'Today' => '今日',
  'This month' => '今月',
  'Monthly' => '今月',
  'Popular' => '人気順',
  'Recent' => '最近更新',
];

